[
  {
    "name": "Web & Mobile",
    "examples": [
      {
        "title": "Interaktive Reise durch den Bachelor der Medieninformatik",
        "subject": "Medienproduktion",
        "semester": 3,
        "technologies": ["HTML", "CSS", "Javascript"],
        "thumbnail": "medienproduktion.jpg",
        "material": "[img]thumb1.jpg",
        "link": "https://hosting.iem.thm.de/mpm-projects/mpm2022e1/",
        "description": "Um Studieninteressierten einen interessanten und interaktiven Ersteindruck zu geben, haben sich Studierende der Medieninformatik im dritten Semester der Aufgabe angenommen, diese webbasierte, animierte Reise durch den Studiengang zu planen, designen und umzusetzen."
      },
      {
        "title": "Tassengenerator",
        "subject": "Webframeworks",
        "semester": 5,
        "technologies": ["Laravel (PHP)", "Blade (PHP)", "Vue.js (Javascript)"],
        "thumbnail": "webframeworks.jpg",
        "material": "[img]tassengenerator.gif",
        "link": "http://87.106.169.186/tassengenerator/blade/public/",
        "description": "In dem Wahlpflichtfach Webframeworks im vorletzten Fachsemester, hat ein zweier Team diesen webbasierten Tassenkonfigurator geplant, designt und umgesetzt. Dabei ist alles, was von einer üblichen eCommerce Webseite erwartet wird vorhanden: Nutzerregistrierung, Login, Bestellung aufgeben und, und, und. Klick dich doch auch gerne mal durch."
      },
      {
        "title": "Dijkstra Story",
        "subject": "Frontend Entwicklung",
        "semester": 5,
        "technologies": ["HTML", "CSS", "Javascript"],
        "thumbnail": "frontend.jpg",
        "material": "[img]dijkstra-story.gif",
        "link": "https://dijkstra-story.robinpatzak.com/",
        "description": "Im Fach Frontend Entwicklung liegt der Hauptaugenmerk, wie der Name schon vermuten lässt, auf dem Design und der Präsentation eines Projektes. Das zweier Team hinter der 'Dijkstra Story' hat es sich zur Aufgabe gemacht, die Funktionalität des Wegfindungsalgorithmus nach Dijkstra (diesen wirst du im Studiengang auch benötigen), anschaulich und optisch ansprechend zu erläutern. Mach dich doch gerne schonmal auf die Art mit dem Algorithmus vertraut."
      },
      {
        "title": "Bug Defender",
        "subject": "Mobile Anwendungen 2",
        "semester": 5,
        "technologies": ["Android", "Kotlin"],
        "thumbnail": "mow2.jpg",
        "material": "[img]bug-defender.gif",
        "link": null,
        "description": "Dieses Mobile Game ist in einem vierer Team entstanden und wurde nativ für Android entwickelt. Aufwändige Grafiken, liebevolle Audiogestaltung und ein hoher Spielspaß waren hier die wichtigsten Bestandteile für das Team. An diesem Projekt kannst du sehen, dass du keine Angst haben brauchst, immer nur hoch seriöse Projekte umzusetzen, sondern dass du deiner Kreativität auch gerne freien lauf lassen darfst. "
      }
    ]
  },
  {
    "name": "Audiovisuelle Medien",
    "examples": [
      {
        "title": "David Bowie - Lazarus",
        "subject": "Audiovisuelle Medien 2",
        "semester": 2,
        "technologies": ["Davinci Resolve", "Logic Pro"],
        "thumbnail": "av2-1.jpg",
        "material": "[video]lazarus.mp4",
        "link": null,
        "description": "Dieses Projekt ist, mit Anleitung der Modulverantwortlichen, komplett in Regie eines siebener Teams an Student*innen entstanden. Es wird von den Dozenten eine sehr realistische Situation erschaffen - du bekommst einen fiktiven Auftrag, ein Musikvideo zu produzieren und kümmerst dich dann um alles nötige: Anheuerung der Musiker*innen, Locationscouting, Postproduction, und so weiter!"
      },
      {
        "title": "Robbie Williams - Angels",
        "subject": "Audiovisuelle Medien 2",
        "semester": 2,
        "technologies": ["Davinci Resolve", "Logic Pro"],
        "thumbnail": "av2-2.jpg",
        "material": "[video]angels_720p.mp4",
        "link": null,
        "description": "Dieses Projekt ist, mit Anleitung der Modulverantwortlichen, komplett in Regie eines zehner Teams an Student*innen entstanden. Es wird von den Dozenten eine sehr realistische Situation erschaffen - du bekommst einen fiktiven Auftrag, ein Musikvideo zu produzieren und kümmerst dich dann um alles nötige: Anheuerung der Musiker*innen, Locationscouting, Postproduction, und so weiter!"
      },
      {
        "title": "Regeneration",
        "subject": "Fotografie & Bildbearbeitung",
        "semester": 5,
        "technologies": ["Affinity Photo"],
        "thumbnail": "foto.jpg",
        "material": "[img]regeneration.jpg",
        "link": null,
        "description": "Dieses Projekt ist im Zuge des Moduls Fotografie & Bildbearbeitung entstanden, in dem sich Studierende kreativ komplett frei ausleben können. Von der Ideenfindung bis hin zur Fotografierung und Nachbearbeitung ist alles mit dabei. Natürlich wird man dabei auch kompetent von den Modulverantwortlichen unterstützt. Du bist hier aber völlig frei in deiner Projektwahl, und darfst dich komplett austoben!"
      }
    ]
  },
  {
    "name": "Grafische Datenverarbeitung",
    "examples": [
      {
        "title": "Auto",
        "subject": "Grafische Datenverarbeitung 1: Modellierung",
        "semester": 1,
        "technologies": ["Autodesk Maya"],
        "thumbnail": "thumb1.jpg",
        "material": "[img]auto.jpg",
        "link": null,
        "description": "Ein großer Teil der Medieninformatik ist auch die Arbeit an digitalen 3D Grafiken. Dieses Auto wurde eigenhändig von einer Student*in anhand einer ihr zur Verfügung gestellten Blaupause nachmodelliert. Angefangen mit einem einzigen Cube, hast du am Ende ein beeindruckendes Automodell vor dir, auf das du mächtig stolz sein kannst."
      },
      {
        "title": "Shading",
        "subject": "Grafische Datenverarbeitung 2: Shading & Lighting",
        "semester": 2,
        "technologies": ["Autodesk Maya", "Shadermap 4"],
        "thumbnail": "thumb2.jpg",
        "material": "[img]shading.jpg",
        "link": null,
        "description": "Nachdem im ersten Modul das Modellieren eines Objektes im Vordergrund stand, geht es in diesem Modul mehr darum, einem Modell Leben einzuhauchen. Du arbeitest daran, einem Objekt eine realistische und glaubhafte Oberflächenbeschreibung mit Texturen zu geben, und das Modell stimmig in Szene zu setzen mit entsprechenden Lichtquellen. "
      },
      {
        "title": "Animation",
        "subject": "Grafische Datenverarbeitung 3: Animation",
        "semester": 3,
        "technologies": ["Autodesk Maya"],
        "thumbnail": "thumb3.jpg",
        "material": "[img]animation.jpg",
        "link": null,
        "description": "Du hast in den vorigen Modulen schon gelernt, wie man Modelle erschafft, sie stimmig in Szene setzt, aber jetzt wird es richtig interessant: Jetzt geht es darum Modelle zu animieren. Gesichtsausfrücke, glaubhafte Bewegungen und vieles mehr wirst du hier lernen umzusetzen und hast am Ende einen kleinen selbst animierten Clip."
      }
    ]
  }
]
